var Data = ['警官', '歯', 'ガソリン', 'インドネシア', '夜行バス', '魚', '注文', '暗証番号', 'お金', '雨', 'みかん', '経済', '相手', '仕事', 'コート', '危篤', '足', '今', 'ステレオ', '洗濯物', '本棚', '椅子', '秋', '教師', '花', '首相', 'りんご', 'ボーナス', '人気', '材料', 'カップラーメン', '雑誌', 'ビザ', '小説', '旅行', '木曜日', '正月', '晩ご飯', '本屋', '仲間', 'ツイン', 'ビデオ', 'おととい', 'たばこ', '便', '南', '恋愛', 'お釣り', '知識', '郵便局', '間違い電話', '怪我', 'サウジアラビア', '棚', '倍', '規則', '家具', '財布', '階段', '時間', '建物', '服', '猿', 'ズボン', '引き出し', 'ポスター', '明後日', '祖母', '作品', 'シングル', '歌', '野菜', 'バス停', '自動販売機', '雪', 'シャープペンシル', '会社', '泥棒', '煙', '心', 'ご主人', '専門', '陸', 'スペイン', '宝くじ', '赤', '金曜日', '大使館', '風', 'シャツ', 'ポーランド', '係員', 'メートル', '保険証', '長さ', '和食', 'アイスクリーム', '金額', '西', 'プレゼント', '源氏物語', 'ドライバー', '領収書', '親子丼', '物', '席', '本社', '食堂', '池', 'パトカー', 'ポスト', 'チャンス', '機会', '靴下', '設備', '丼', '駅員', 'カレーライス', 'ボール', '姉妹', '受付', '禁煙', '紺', '海外', '台風', '鍋', '転勤', 'テニス', '番', '間違い', '周り', 'ダイエット', '人', 'お見舞い', '天気', 'CD', '調味料', '日', '庭', '傷', '天ぷら', '机', '申し込み', '本日休業', '相撲', 'ガスレンジ', 'お見合い', '枝', 'タオル', '絵葉書', '毎年', '手', '先日', 'レポート', '注射', '自然', 'ご飯', '教室', '女の人', '急用', '曇り', 'ニュース', '会員', '表', '音楽', 'キャッシュカード', '航空便', '熱', '温泉', '肉', '午後', '毎朝', 'ハイキング', '小学校', '刺身', '土曜日', '縁起', '風呂敷', 'お父さん', '母の日', '千', '塩', 'お姫様', '留守', '石', '私たち', '男の人', 'あなた', 'ローマ字', '安全', '栓抜き', '左', '展覧会', '賛成', 'テレビ', '銀行', '学生', 'ミュンヘン', '子供', '耳', '青', '発表', '年齢', '携帯電話', 'お酒', '人々', 'スキー場', '下', '研究者', 'キロ', 'おばあさん', '宅配便', '形', '茶碗', '後ろ', '映画館', '彼女', '僕', '力', '昼ご飯', 'アルバイト', '音楽家', '特に', '髪', '非常口', '建築家', '夢', '新幹線', '作曲', '波', 'ネズミ', '救急車', '製品', 'ダンス', 'ボタン', '皆さん', 'コンテスト', 'カセットテープ', '隅', '塾', 'デパート', 'サービス', 'ライト兄弟', 'パン', '億', '鏡', '寮', '亀', 'アメリカ', '脳', '花火', '駅', '大学生', 'エンジン', '中身', '試験', 'ドイツ', '風邪', '出口', 'タイ', 'ハンコ', '光', '歴史', '明日', '東', 'コンサート', '壁', 'お客様', 'マスク', 'スイッチ', '論文', 'イタリア', '交番', 'アフリカ', 'エアコン', 'トラック', '独身', 'コース', '昼間', '新聞', '罰金', '今月', '文化', '食欲', '牡牛座', '音', 'ポケット', 'チョコレート', 'キー', '空', '辞書', '勉強', '時計', 'プレイガイド', 'ノート', '窓', 'カーテン', 'サラリーマン', 'フロント', '特急', 'サイズ', '美術館', 'カラオケ', '和室', '料理', '空港', '名前', '部長', 'クラシック', '針', '田舎', 'ファイト', '上', '宿題', '朝ご飯', 'カット', 'テーブル', 'バラ', '希望', '現金', '嘘', '将来', 'つまみ', '線', '外', 'トイレ', '午前', '説明書', '話', '分', 'ベトナム', '海岸', '大統領', '世紀', '成績', '春', '番組', '電報', '店', '世界', 'お姉さん', '回覧', '恋人', '水泳', '下着', '火', '旅館', '家族', '飲み物', '手紙', '道具', '目的', '気持ち', 'ブラジル', '食べ物', 'すき焼き', '着物', '医者', 'エンジニア', 'マンション', 'エスカレーター', '研究室', 'スポーツ', 'テスト', '毎日', '果物', '夏', 'パスポート', '作家', '具合', 'ジェル', 'ネクタイ', '理由', '玄関', '大学院', 'テープ', '予定表', 'ボールペン', '冬', '口', '売り場', '友達', '反対', '鳥', '山', 'カレンダー', '地球', 'パーティー', '次', 'ソフト', '水', '押し入れ', 'バリ島', 'ジャズ', '太陽', 'セット', '窓側', '通信販売', '夜', 'そろばん', 'ドア', 'ホテル', 'カリフォルニア', '習慣', '入門', 'グアム', '実験', '値段', 'ミキサー', '赤ちゃん', '動物園', '文学', '咳', '大人', '体温計', '用事', 'ストレス', '会話', 'マラソン', '博士', 'キャンプ', 'コップ', '切符', '人口', 'シャンプー', '裏', '操作', 'パンチ', '芸', '景色', '方法', '曲', 'おかず', '花瓶', '科学者', '映画', 'ドライブ', 'スケジュール', '高さ', '入館', 'たまねぎ', '白馬', 'コーヒー', 'クリーニング', '夕方', '準備', '式', 'カップ', '許可', '事務所', '会議室', 'きりん', 'グループ', '土地', '以下', 'カタログ', '法律', '国際', '料理教室', 'シーサー', 'ジュース', '母', '騒音', '大学', '回答', '電池', '祭り', 'お茶', '天気予報', '課長', 'サンドイッチ', '活動', 'パチンコ', '家賃', '急行', '恋', '奥さん', '牛乳', '歳', '平和', '図書館', '味', 'ガスサービスセンター', '昼休み', '政治', '食品', 'マーク', '地図', '書類', '小説家', '北', 'ホルモン', '火曜日', '兄', '山登り', '今週', '醤油', '授業', '毎月', '男の子', 'ロボット', 'ゴルフ', '教育', '寿司', '叔母', 'プール', '障害', '生け花', '電話代', 'お花見', '速達', '絵', '風呂', 'オートバイ', '方', '戦争', '忘年会', '水道', '卵', '緑', '昼', '先月', '秒', 'ミーティング', '以上', '外国', '犬', '関係', '駐車場', '外国人登録証', '使用中', '化粧品', 'デザイン', '父', '歌舞伎', '薬', '蓋', '駐車違反', '電気屋', '予定', '剣道', '孫', '上着', 'ラッシュ', '銀行員', 'やかん', '廊下', '調子', 'エレベーター ', 'お土産', '今日', '村', 'ケーキ', '来年', '寺', '歯医者', '手帳', '両親', '会場', '点', '楽しみ', '叔父', 'セロテープ', '馬', 'イラン', 'インターネット', '月曜日', '弟', '色', 'フォーク', '火事', 'カード', '紙', '角', '地震', '乗り物', 'データ', '象', '作文', 'グラム', '社長', '健康', 'シャワー', '重さ', 'ペット', '息子', '毎週', 'インスタントラーメン', 'スキー', '釣り', '昨日', '部屋', '弁護士', 'ワープロ', '靴', '貿易', 'ファックス', '水曜日', 'レバー', '原爆ドーム', 'パンフレット', '登録', '生徒', 'おじいさん', '挨拶', '写真', '矢印', '麦', 'アパート', 'コンピューター', '病院', '彼', '君', '韓国', '箸', '自動車', 'クリスマス', '帽子', '目覚まし時計', '人形', '動物', 'ガム', '主人', 'サッカー', '冷房', '普通', '金持ち', '紫式部', 'ベッド', '絵本', '半分', 'スピーチ', '万', 'お礼', '給料', '階', '車', '女の子', '新年会', '明日（あす）', 'ファイル', '意味', '連休', '缶詰', 'お腹', '江戸時代', '洋服', 'アクセス', '白', '元の所', '月', '国連', '町', 'お宅', '男性', 'スーツ', '船', '番号', '丸', '半', '道', '洋食', '交差点', '布団', '事', '支社', '学校', 'ロビー', '物価', '技術', '日本製', '双子', '紅葉', '自転車', '時刻表', '床屋', '情報', '涙', '返事', '米', '性格', '先週', '問題', '大きさ', 'ビル', 'セーター', '紐', 'ホッチキス', '百', '運転手', 'スタート', 'ドラマ', '来週', 'はさみ', 'ガイド', '社員', '住所', '教会', 'エアメール', '中', 'ミルク', '会議', '袋', '調査', '英語', 'お兄さん', 'センス', '飛行機', '網棚', '私', 'ソース', '葉', 'オーストラリア', '医学', '電気', '暖房', '生活', '平仮名', '前', 'オリンピック', '成人式', 'ゴッホ', '宇宙', '弁当', 'インド', '石油', '鞄', '犯人', '中学校', '交通', '科学', '日本語', '週末', '子供達', '中国', 'テープレコーダー', '管理人', '個', '営業', '信号', 'カメラ', '一昨年', '冷蔵庫', '猫', '化粧', '時', 'デート', '確認', '石鹸', '女性', '朝', '入口', 'お菓子', '消しゴム', '所', '片仮名', '定食', '留学生', '餌', '病気', '社会', 'バッグ', 'お知らせ', '日記', '悲しみ', '茶道', '海', '高校', '電車', '灰皿', '趣味', '資料', '賞金', '雪まつり', '市役所', 'お国', '表現', '品物', '昔', '事故', '平均寿命', '空気', 'ビール', '草津', 'ショート', 'ベートーベン', '杯', 'センチ', '桜', '漫画', 'ハンカチ', 'スーパー', 'クラス', '文法', '眼鏡', '右', '汗', 'お子さん', '頭', '図', 'スイス', '声', '日本', '営業中', '講義', '無料', '黒', '体', '原因', '興味', 'ガラス', '警察', '会社員', '量', '箱', '鍵', '美術', '今年', 'インフルエンザ', 'お手洗い', '機械', '歌手', '妻', '可愛い', 'ユーモア', 'スポーツクラブ', 'キーワード', '葬式', '休み', '自分', '旅行者', '祈り', '大会', '円', '原料', 'メキシコ', '祖父', '真ん中', 'ヨーロッパ', '号', '書留', '二次会', 'お年玉', 'お祝い', '係', '砂糖', '今夜', '中止', 'フランス', 'ジョギング', 'グラハム・ベル', '名刺', '毎晩', '妹', '電子', '飴', '箱根', 'バス', 'レストラン', '電源', '忘れ物', '誕生日', '順序', '玩具', '日曜日', '先生', '約束', 'タクシー', '郊外', 'パソコン', '娘', '家内', 'スピード', '立入禁止', '体育館', '初めに', '〜号室', '長男', '贈り物', '試合', 'タンス', '経験', '切手', '結婚式', '夫', '講師', '電話', '目', '橋', '星', 'サーカス', 'ミュージカル', 'シートベルト', '留守番', '傘', 'ワイン', 'アジア', '掃除機', '工場', '故障', 'ピアノ', '紅茶', '収入', '漢字', '野球', 'フィルム', '答え', '手袋', ' 喫茶店', '昔話', '鉛筆', 'ミリ', '家', '冊', 'ドミニカ', 'はがき', '神社', '意見', '星占い', '駅前', 'ピラミッド', '地下', 'ローン', '荷物', '晩', 'イギリス', '宝庫', '皿', '地下鉄', '使用禁止', '火傷', '東照宮', '隣', '案内書', '指輪', '事件', '言葉', '本', 'お母さん', 'スプーン', '去年', 'ラジオ', 'チケット', 'ナイフ', '日光', '川', 'お客さん', '様子', '公園', '都会', '字', '季節', '兄弟', '顔', '昨夜', 'アルバム', '悩み', '姿', '木', 'システム', '牛丼', '姉', '台所', 'チーム', '来月', '封筒', '胃', '船便', '保証書']

function OnButtonClick() {
    target = document.getElementById("text");
    var textBefore = target.value;
    
    var textBeforeArry = textBefore.split().length
    while ( textBeforeArry != textBefore.split("[???]").length){
        a = textBefore.replace("[???]",Data[getRandomInt(0,Data.length+1)]);
        textBefore = a;
        var textAfter = a;
    }
    document.getElementById("out").innerHTML = textAfter;
    setTweetButton("こんな文章になりました！！" +"『"+ textAfter+"』")
    
}

/*function setTweetButton(text){
      document.getElementById("tweet-area"),
      {
        text: "こんな文章になりました！！" +"『"+ document.getElementById("out").innerHTML+"』"
      }
  }*/
  
  function setTweetButton(text){
    $('#tweet-area').empty(); //既存のボタン消す
    // htmlでスクリプトを読んでるからtwttがエラーなく呼べる
    // オプションは公式よんで。
    twttr.widgets.createShareButton(
      "",
      document.getElementById("tweet-area"),
      {
        size: "large", //ボタンはでかく
        text: text, // 狙ったテキスト
      }
    );
  }



function getRandomInt(min, max) {
    min = Math.ceil(min);
    max = Math.floor(max);
    return Math.floor(Math.random() * (max - min) + min); //The maximum is exclusive and the minimum is inclusive
  }

